package org.paokk.hl7.parser;

import org.paokk.hl7.parser.model.ORU_R01_ZQ;

public class TestHL7Parser {

    public static void main(String[] args) {

        String hl7 = "MSH|^~\\&|HIS||ESB||20210918140521||ORM^O01^ORM_O01|169bb7ac-6180-4e04-b42b-07713334966b|P|2.6^^&&&&D56D2C42401AAC6F36&&V1.0|||NE|AL||UTF-8\r" +
                "PID||201532012|652101198612221332^^^^01||马志明^^^MA ZHI MING||19861222000000|1|||&华容文化路 179 号^华容^岳阳^湖南||18907804328^^^^^^^^^^^|||^^2|||652101198612221332|||^汉族^1\r" +
                "PV1||1|101022101||||123123|||||1|0||||||2||||||||||||||||||||H0002|||||20220126094730\r" +
                "ORC|NW|01D2018050800001|||||||20210918135813|||101275^ 张 大 大 ||||||||| 产 科 病 区^^1300110||||||20210920183000||D|||放射科^^1801010\r" +
                "OBR|1|||0517100247^右膝关节 MRI(平扫)|0|||||||核磁项目|双膝关节隐痛 2 年,双膝关节运动疼痛，爬山及爬楼梯等活动受限，平路行走尚可，,双膝无明显肿胀，无明显压痛|||||1|574.00|89.22|||||1\r" +
                "DG1|1||QTZ221^虚眩|||1|||||||||||||||||1^是\r" +
                "NTE|1||汇报医生|1234^张医生^^13123^外科||20220301184119\r" +
                "NTE|2||汇报医生2|1234^张医生2^^13123^外科2||20220301184119";

        HL7Parser hl7Parser = new HL7Parser(hl7);

        ORU_R01_ZQ oru = hl7Parser.parse(ORU_R01_ZQ.class);

        System.out.println(oru);

    }
}
